Revit 2027 API
FormUtils Methods
The FormUtils type exposes the following members.
Methods
Name | Description
CanBeDissolved |  Validates that input contains one or more form elements or geom combinations containing form elements.
DissolveForms(Document, ICollection<ElementId>) |  Dissolves a collection of form elements into their defining elements.
DissolveForms(Document, ICollection<ElementId>, ICollection<ElementId>) |  Dissolves a collection of form elements into their defining elements.
Top
See Also
Reference
FormUtils Class
Autodesk.Revit.DB Namespace